a=["198.22.21.56","198.23.24.77","198.23.21.44","198.32.34.22"]#表示列表
print(a)
#字符串转列表
b="shwgd"
c=list(b)
print(c)#可以用list来生成列表
#转range范围
d=list()
for i in range(5):
    d.append(i)
print(d)#0,1,2,3,4
#转元组
e=(10,20,30)#元组
f=list(e)
print(f)
#列表的索引和切片
print(a[1])
print(a[1:3])
print(a[4:1:-1])
#显示出的答案是['198.32.34.22', '198.23.21.44']
#原因是根据python语法规则a列表里四个元素分别是a[0],a[1],a[2],a[3],所以不存在a[4]
#python会自动修正为a[3:1:-1],因为a[1]固定是取不到的，所以能取到的只有a[2],a[3]
#加上步长为负数，所以倒过来写先取a[3],再取a[2]
#列表和字符串的索引切片一样


#给列表新增数据
g=[]
g.append('于超')
g.append('小团子')#无返回值，不用新增一个变量h=g.append(),无效
print(g)#在列表末尾不断追加新数据

#给列表的某个位置插入新数据
g.insert(1,"李莉")#于超，李莉，小团子
print(g)

#两个列表进行合并
a.extend(g)
print(a)

#对列表进行修改
g[0]="小马虎"
print(g)#小马虎，李莉，小团子

#列表删除
#pop(Index)根据指定的索引删除数据，返回被删除的数据
k=g.pop(1)#返回的值表示被删的数
print(g)#小马虎，小团子
print(k)#李莉
L=g.pop()#括号里不填默认把列表最后一个弹出去
print(L)#小团子
print(g)#小马虎

#remove进行列表删除
a=["198.22.21.56","198.23.24.77","198.23.21.44","198.32.34.22","198.23.21.44"]
a.remove("198.23.21.44")#列表中存在两个一模一样的元素，删除的话只删从左往右数的第一个
print(a)#a=["198.22.21.56","198.23.24.77","198.32.34.22","198.23.21.44"]

#查询数据
#1、普通查询
a=["198.22.21.56","198.23.24.77","198.23.21.44","198.32.34.22","198.23.21.44"]
print(a[2])

#2、循环查询
m=-1
a=["198.22.21.56","198.23.24.77","198.23.21.44","198.32.34.22","198.23.21.44"]
for i in a:
    m+=1
    if i=="198.23.21.44":
        print(f"a{m}")

#修改某个元素的一部分（循环元素）
a=["198.22.21.56","198.23.24.57","198.23.21.44","198.32.34.22","198.23.21.44"]
m=-1
for n in a:#定义列表a当中的具体元素
    m+=1#生成列表索引
    if n[10]=="5":#修改具体元素的部分
       # n[10]="0"不能通过修改n的部分来得到一个新的n，因为字符串不可变
       a[m]=n[:10]+'0'+n[11:]#将修改的元素返回列表
       print(a[m])
print(a)

#循环索引
a=["198.22.21.56","198.23.24.57","198.23.21.44","198.32.34.22","198.23.21.44"]
for v in range(len(a)):#len用来计算a的长度
    x=a[v]
    if x[10]=="5":
        a[v]=x[:10]+'0'+x[11:]
print(a)

#进行列表定位
print(a.index('198.23.24.07'))

#反转列表
a.reverse()
print(a)#不可以直接写print(a.reverse())

#列表排序
jj=[1,4,2,3]
jj.sort()
print(jj)